#include <iostream>

using namespace std;

int main()
{
    //unsigned int start_time =  clock(); // начальное время
        // здесь должен быть фрагмент кода, время выполнения которого нужно измерить

   long int N, Q = 0 ,p = 1;
   cin >> N; // вводимо число
   if(N==0) // zякщо воно 0, Q=10
    {
        cout<<"10"<<endl;
        return 0;
    }
    if(N<10) // якщо число з 1 цифри, виводимо саме це число
    {
        cout<<N<<endl;
        return 0;
    }
    // для інших чисел алгоритм наступний: знаходимо на кожному кроці ітерації найбільший  дільник числа, дільник складається з 1 цифри!
    // запонюємо число Q цими дільниками у зворотньому порядку, аби число Q було найменше
    for(int div = 9; div > 1; --div)
    {
        while( (N%div) == 0)
        {
            Q += p * div;
            p = p * 10;
            N /= div;
        }
    }
    // якщо після цих кроків, результат ділення на всі одноцифрові дільники більше 1, значить число розкладаєьбся на дільники більше 9,
    // наприклад, 44=4*11, в нас же вимагається щоб дільнкии складались з 1 цифри
  if(N>1)
    {
        cout<<"-1"<<endl;
        return 0;
    }
  // виводимо результат
   cout << Q << endl;
//   unsigned int end_time = clock(); // конечное время
//   unsigned int search_time = end_time - start_time; // искомое
//   cout<<search_time;
    return 0;
}
